#### PrintRange Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing all Print Range types of Print.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum PrintRange ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration PrintRange ``` |

| Visual C++ |
| --- |
| ``` public enum class PrintRange ``` |

# Members

| Member name | Description |
| --- | --- |
| Current | A range that represents just the currently active view. |
| Visible | Visible portion of current window. |
| Select | A range that represents a list of selected views and sheets. |

# See Also

Autodesk.Revit.DB Namespace